Could not generate fabrication shape
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
 Syntax
  C#
public static FailureDefinitionId FabricationShapeCannotGenerate { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationShapeCannotGenerate As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationShapeCannotGenerate {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures FabricationShapeFailures Class
  Autodesk.Revit.DB Namespace